## 0. 넘파이 알아보기

In [2]:
import numpy as np

In [3]:
np.__version__

'1.21.6'

## 0-1 다차원 배열 만들기

### 넘파이 1차원 배열을 만들고 출력하기

In [2]:
my_list = [1, 2, 3, 4, 5]
my_array = np.array(my_list)

print(my_array)

[1 2 3 4 5]

### 넘파이 배열을 특정 범위에 딸라 만들고 출력하기

In [4]:
my_range_array = np.arange(0, 10, 2)

print(my_range_array)

[0 2 4 6 8]

## 0-2 다차원 배열을 만들기

In [5]:
my_range_array = np.arange(0, 20).reshape(10,2)

print(my_range_array)

[[ 0  1]
 [ 2  3]
 [ 4  5]
 [ 6  7]
 [ 8  9]
 [10 11]
 [12 13]
 [14 15]
 [16 17]
 [18 19]]

In [6]:
my_range_array.shape

(10, 2)

## 0-3 랜덤모듈로 다차원 배열 만들기

In [7]:
my_random_array = np.random.rand(2, 3)

print(my_random_array)

[[0.97998995 0.88823071 0.08644083]
 [0.40591931 0.50055669 0.77386205]]

In [8]:
my_random_array.shape

(2, 3)

# 1.  판다스 기본 알아보기

- 판다스 모듈은 행과 열로 구성된 2차원 배열의 형태를 잘 처리할 수 있는 모듈
- 2차원 배열을 데이터프레임으로 만들어서 관리
- 이 데이터프레임은 엑셀의 시트, 데이터베이스의 테이블 과 같은 구조이다.

## 1-1 판다스 기본 개념 

-  판다스 모듈을 사용하기 위해서는 import 해야한다.
- 보통 판다스 모듈은 별칭 pd를 지정해서 사용한다.
- 판다스 모듈의 버전을 꼭 확인해본다.

### 판다스 모듈의 별칭을 pd로 정하기

In [3]:
import pandas as pd

### 판다스 모듈의 버전을 확인하기

In [11]:
pd.__version__

'1.5.3'

## 주요 클래스 : 

- 판다스 모듈을 처리하기 위한 데이터 구조는 2차원은 데이터프레임, 1차원은 시리즈이다. 
- 이 두 가지를 모두 클래스로 지원한다.

## 데이터프레임

![](../image/데이터프레임.png)

In [12]:
pd.DataFrame

pandas.core.frame.DataFrame

## 시리즈

![](../image/시리즈.png)

In [13]:
pd.Series

pandas.core.series.Series

## 다차원 배열을 넣고 데이터프레임 생성하기

In [14]:
df_ = pd.DataFrame(my_random_array, columns=list("abc"))

In [15]:
df_

          a         b         c
0  0.979990  0.888231  0.086441
1  0.405919  0.500557  0.773862

## 데이터프레임의 스키마 정보 

- 칼럼정보 : columns
- 행정보   : index
- 데이터프레임의 형태 : shape
- 데이터프레임의 값 : values

In [18]:
df_.columns

Index(['a', 'b', 'c'], dtype='object')

In [19]:
df_.index

RangeIndex(start=0, stop=2, step=1)

In [20]:
df_.shape

(2, 3)

### 데이터프레임의 값은 넘파이 다차원 배열로 관리

In [17]:
df_.values

array([[0.97998995, 0.88823071, 0.08644083],
       [0.40591931, 0.50055669, 0.77386205]])

## 1-2  CSV 파일 읽고 기본 정보 확인하기  

- 판다스 모듈에서 csv 확장자 파일을 읽으면 바로  데이터프레임 객체로 변환한다.
- 위에서 배운 것처럼 다차원 배열에 값을 저장하고 스키마 정보에 따라서 데이터프레임을 처리해 준다.

### 파일 위치를 지정하기 

-  자주 사용하려면 특정 파일의 경로를 지정한다.

In [21]:
path = "../data/train.csv"

###  csv 파일을 읽는 read_csv 함수 기능 확인하기 

- 함수, 클래스, 메서드 등의 기능에 대한 설명을 help로 확인할 수 있다.

In [6]:
help(pd.read_csv)

Help on function read_csv in module pandas.io.parsers.readers:

read_csv(filepath_or_buffer: 'FilePath | ReadCsvBuffer[bytes] | ReadCsvBuffer[str]', sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, squeeze=None, prefix=<no_default>, mangle_dupe_cols=True, dtype: 'DtypeArg | None' = None, engine: 'CSVEngine | None' = None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=None, infer_datetime_format=False, keep_date_col=False, date_parser=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression: 'CompressionOptions' = 'infer', thousands=None, decimal: 'str' = '.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors: 'str | None' = 'strict', dialect=None, error_bad_lines=None, warn_bad_lines=None, on_bad_lines=None, delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options: 'StorageOptions' = None)
    Read a comma-separated values (csv) file into DataFrame.

    Also supports optionally iterating or breaking of the file
    into chunks.

    Additional help can be found in the online docs for
    `IO Tools <https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html>`_.

    Parameters
    ----------
    filepath_or_buffer : str, path object or file-like object
        Any valid string path is acceptable. The string could be a URL. Valid
        URL schemes include http, ftp, s3, gs, and file. For file URLs, a host is
        expected. A local file could be: file://localhost/path/to/table.csv.

        If you want to pass in a path object, pandas accepts any ``os.PathLike``.

        By file-like object, we refer to objects with a ``read()`` method, such as
        a file handle (e.g. via builtin ``open`` function) or ``StringIO``.
    sep : str, default ','
        Delimiter to use. If sep is None, the C engine cannot automatically detect
        the separator, but the Python parsing engine can, meaning the latter will
        be used and automatically detect the separator by Python's builtin sniffer
        tool, ``csv.Sniffer``. In addition, separators longer than 1 character and
        different from ``'\s+'`` will be interpreted as regular expressions and
        will also force the use of the Python parsing engine. Note that regex
        delimiters are prone to ignoring quoted data. Regex example: ``'\r\t'``.
    delimiter : str, default ``None``
        Alias for sep.
    header : int, list of int, None, default 'infer'
        Row number(s) to use as the column names, and the start of the
        data.  Default behavior is to infer the column names: if no names
        are passed the behavior is identical to ``header=0`` and column
        names are inferred from the first line of the file, if column
        names are passed explicitly then the behavior is identical to
        ``header=None``. Explicitly pass ``header=0`` to be able to
        replace existing names. The header can be a list of integers that
        specify row locations for a multi-index on the columns
        e.g. [0,1,3]. Intervening rows that are not specified will be
        skipped (e.g. 2 in this example is skipped). Note that this
        parameter ignores commented lines and empty lines if
        ``skip_blank_lines=True``, so ``header=0`` denotes the first line of
        data rather than the first line of the file.
    names : array-like, optional
        List of column names to use. If the file contains a header row,
        then you should explicitly pass ``header=0`` to override the column names.
        Duplicates in this list are not allowed.
    index_col : int, str, sequence of int / str, or False, optional, default ``None``
      Column(s) to use as the row labels of the ``DataFrame``, either given as
      string name or column index. If a sequence of int / str is given, a
      MultiIndex is used.

      Note: ``index_col=False`` can be used to force pandas to *not* use the first
      column as the index, e.g. when you have a malformed file with delimiters at
      the end of each line.
    usecols : list-like or callable, optional
        Return a subset of the columns. If list-like, all elements must either
        be positional (i.e. integer indices into the document columns) or strings
        that correspond to column names provided either by the user in `names` or
        inferred from the document header row(s). If ``names`` are given, the document
        header row(s) are not taken into account. For example, a valid list-like
        `usecols` parameter would be ``[0, 1, 2]`` or ``['foo', 'bar', 'baz']``.
        Element order is ignored, so ``usecols=[0, 1]`` is the same as ``[1, 0]``.
        To instantiate a DataFrame from ``data`` with element order preserved use
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['foo', 'bar']]`` for columns
        in ``['foo', 'bar']`` order or
        ``pd.read_csv(data, usecols=['foo', 'bar'])[['bar', 'foo']]``
        for ``['bar', 'foo']`` order.

        If callable, the callable function will be evaluated against the column
        names, returning names where the callable function evaluates to True. An
        example of a valid callable argument would be ``lambda x: x.upper() in
        ['AAA', 'BBB', 'DDD']``. Using this parameter results in much faster
        parsing time and lower memory usage.
    squeeze : bool, default False
        If the parsed data only contains one column then return a Series.

        .. deprecated:: 1.4.0
            Append ``.squeeze("columns")`` to the call to ``read_csv`` to squeeze
            the data.
    prefix : str, optional
        Prefix to add to column numbers when no header, e.g. 'X' for X0, X1, ...

        .. deprecated:: 1.4.0
           Use a list comprehension on the DataFrame's columns after calling ``read_csv``.
    mangle_dupe_cols : bool, default True
        Duplicate columns will be specified as 'X', 'X.1', ...'X.N', rather than
        'X'...'X'. Passing in False will cause data to be overwritten if there
        are duplicate names in the columns.
    dtype : Type name or dict of column -> type, optional
        Data type for data or columns. E.g. {'a': np.float64, 'b': np.int32,
        'c': 'Int64'}
        Use `str` or `object` together with suitable `na_values` settings
        to preserve and not interpret dtype.
        If converters are specified, they will be applied INSTEAD
        of dtype conversion.
    engine : {'c', 'python', 'pyarrow'}, optional
        Parser engine to use. The C and pyarrow engines are faster, while the python engine
        is currently more feature-complete. Multithreading is currently only supported by
        the pyarrow engine.

        .. versionadded:: 1.4.0

            The "pyarrow" engine was added as an *experimental* engine, and some features
            are unsupported, or may not work correctly, with this engine.
    converters : dict, optional
        Dict of functions for converting values in certain columns. Keys can either
        be integers or column labels.
    true_values : list, optional
        Values to consider as True.
    false_values : list, optional
        Values to consider as False.
    skipinitialspace : bool, default False
        Skip spaces after delimiter.
    skiprows : list-like, int or callable, optional
        Line numbers to skip (0-indexed) or number of lines to skip (int)
        at the start of the file.

        If callable, the callable function will be evaluated against the row
        indices, returning True if the row should be skipped and False otherwise.
        An example of a valid callable argument would be ``lambda x: x in [0, 2]``.
    skipfooter : int, default 0
        Number of lines at bottom of file to skip (Unsupported with engine='c').
    nrows : int, optional
        Number of rows of file to read. Useful for reading pieces of large files.
    na_values : scalar, str, list-like, or dict, optional
        Additional strings to recognize as NA/NaN. If dict passed, specific
        per-column NA values.  By default the following values are interpreted as
        NaN: '', '#N/A', '#N/A N/A', '#NA', '-1.#IND', '-1.#QNAN', '-NaN', '-nan',
        '1.#IND', '1.#QNAN', '<NA>', 'N/A', 'NA', 'NULL', 'NaN', 'n/a',
        'nan', 'null'.
    keep_default_na : bool, default True
        Whether or not to include the default NaN values when parsing the data.
        Depending on whether `na_values` is passed in, the behavior is as follows:

        * If `keep_default_na` is True, and `na_values` are specified, `na_values`
          is appended to the default NaN values used for parsing.
        * If `keep_default_na` is True, and `na_values` are not specified, only
          the default NaN values are used for parsing.
        * If `keep_default_na` is False, and `na_values` are specified, only
          the NaN values specified `na_values` are used for parsing.
        * If `keep_default_na` is False, and `na_values` are not specified, no
          strings will be parsed as NaN.

        Note that if `na_filter` is passed in as False, the `keep_default_na` and
        `na_values` parameters will be ignored.
    na_filter : bool, default True
        Detect missing value markers (empty strings and the value of na_values). In
        data without any NAs, passing na_filter=False can improve the performance
        of reading a large file.
    verbose : bool, default False
        Indicate number of NA values placed in non-numeric columns.
    skip_blank_lines : bool, default True
        If True, skip over blank lines rather than interpreting as NaN values.
    parse_dates : bool or list of int or names or list of lists or dict, default False
        The behavior is as follows:

        * boolean. If True -> try parsing the index.
        * list of int or names. e.g. If [1, 2, 3] -> try parsing columns 1, 2, 3
          each as a separate date column.
        * list of lists. e.g.  If [[1, 3]] -> combine columns 1 and 3 and parse as
          a single date column.
        * dict, e.g. {'foo' : [1, 3]} -> parse columns 1, 3 as date and call
          result 'foo'

        If a column or index cannot be represented as an array of datetimes,
        say because of an unparsable value or a mixture of timezones, the column
        or index will be returned unaltered as an object data type. For
        non-standard datetime parsing, use ``pd.to_datetime`` after
        ``pd.read_csv``. To parse an index or column with a mixture of timezones,
        specify ``date_parser`` to be a partially-applied
        :func:`pandas.to_datetime` with ``utc=True``. See
        :ref:`io.csv.mixed_timezones` for more.

        Note: A fast-path exists for iso8601-formatted dates.
    infer_datetime_format : bool, default False
        If True and `parse_dates` is enabled, pandas will attempt to infer the
        format of the datetime strings in the columns, and if it can be inferred,
        switch to a faster method of parsing them. In some cases this can increase
        the parsing speed by 5-10x.
    keep_date_col : bool, default False
        If True and `parse_dates` specifies combining multiple columns then
        keep the original columns.
    date_parser : function, optional
        Function to use for converting a sequence of string columns to an array of
        datetime instances. The default uses ``dateutil.parser.parser`` to do the
        conversion. Pandas will try to call `date_parser` in three different ways,
        advancing to the next if an exception occurs: 1) Pass one or more arrays
        (as defined by `parse_dates`) as arguments; 2) concatenate (row-wise) the
        string values from the columns defined by `parse_dates` into a single array
        and pass that; and 3) call `date_parser` once for each row using one or
        more strings (corresponding to the columns defined by `parse_dates`) as
        arguments.
    dayfirst : bool, default False
        DD/MM format dates, international and European format.
    cache_dates : bool, default True
        If True, use a cache of unique, converted dates to apply the datetime
        conversion. May produce significant speed-up when parsing duplicate
        date strings, especially ones with timezone offsets.

        .. versionadded:: 0.25.0
    iterator : bool, default False
        Return TextFileReader object for iteration or getting chunks with
        ``get_chunk()``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    chunksize : int, optional
        Return TextFileReader object for iteration.
        See the `IO Tools docs
        <https://pandas.pydata.org/pandas-docs/stable/io.html#io-chunking>`_
        for more information on ``iterator`` and ``chunksize``.

        .. versionchanged:: 1.2

           ``TextFileReader`` is a context manager.
    compression : str or dict, default 'infer'
        For on-the-fly decompression of on-disk data. If 'infer' and '%s' is
        path-like, then detect compression from the following extensions: '.gz',
        '.bz2', '.zip', '.xz', or '.zst' (otherwise no compression). If using
        'zip', the ZIP file must contain only one data file to be read in. Set to
        ``None`` for no decompression. Can also be a dict with key ``'method'`` set
        to one of {``'zip'``, ``'gzip'``, ``'bz2'``, ``'zstd'``} and other
        key-value pairs are forwarded to ``zipfile.ZipFile``, ``gzip.GzipFile``,
        ``bz2.BZ2File``, or ``zstandard.ZstdDecompressor``, respectively. As an
        example, the following could be passed for Zstandard decompression using a
        custom compression dictionary:
        ``compression={'method': 'zstd', 'dict_data': my_compression_dict}``.

        .. versionchanged:: 1.4.0 Zstandard support.

    thousands : str, optional
        Thousands separator.
    decimal : str, default '.'
        Character to recognize as decimal point (e.g. use ',' for European data).
    lineterminator : str (length 1), optional
        Character to break file into lines. Only valid with C parser.
    quotechar : str (length 1), optional
        The character used to denote the start and end of a quoted item. Quoted
        items can include the delimiter and it will be ignored.
    quoting : int or csv.QUOTE_* instance, default 0
        Control field quoting behavior per ``csv.QUOTE_*`` constants. Use one of
        QUOTE_MINIMAL (0), QUOTE_ALL (1), QUOTE_NONNUMERIC (2) or QUOTE_NONE (3).
    doublequote : bool, default ``True``
       When quotechar is specified and quoting is not ``QUOTE_NONE``, indicate
       whether or not to interpret two consecutive quotechar elements INSIDE a
       field as a single ``quotechar`` element.
    escapechar : str (length 1), optional
        One-character string used to escape other characters.
    comment : str, optional
        Indicates remainder of line should not be parsed. If found at the beginning
        of a line, the line will be ignored altogether. This parameter must be a
        single character. Like empty lines (as long as ``skip_blank_lines=True``),
        fully commented lines are ignored by the parameter `header` but not by
        `skiprows`. For example, if ``comment='#'``, parsing
        ``#empty\na,b,c\n1,2,3`` with ``header=0`` will result in 'a,b,c' being
        treated as the header.
    encoding : str, optional
        Encoding to use for UTF when reading/writing (ex. 'utf-8'). `List of Python
        standard encodings
        <https://docs.python.org/3/library/codecs.html#standard-encodings>`_ .

        .. versionchanged:: 1.2

           When ``encoding`` is ``None``, ``errors="replace"`` is passed to
           ``open()``. Otherwise, ``errors="strict"`` is passed to ``open()``.
           This behavior was previously only the case for ``engine="python"``.

        .. versionchanged:: 1.3.0

           ``encoding_errors`` is a new argument. ``encoding`` has no longer an
           influence on how encoding errors are handled.

    encoding_errors : str, optional, default "strict"
        How encoding errors are treated. `List of possible values
        <https://docs.python.org/3/library/codecs.html#error-handlers>`_ .

        .. versionadded:: 1.3.0

    dialect : str or csv.Dialect, optional
        If provided, this parameter will override values (default or not) for the
        following parameters: `delimiter`, `doublequote`, `escapechar`,
        `skipinitialspace`, `quotechar`, and `quoting`. If it is necessary to
        override values, a ParserWarning will be issued. See csv.Dialect
        documentation for more details.
    error_bad_lines : bool, optional, default ``None``
        Lines with too many fields (e.g. a csv line with too many commas) will by
        default cause an exception to be raised, and no DataFrame will be returned.
        If False, then these "bad lines" will be dropped from the DataFrame that is
        returned.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    warn_bad_lines : bool, optional, default ``None``
        If error_bad_lines is False, and warn_bad_lines is True, a warning for each
        "bad line" will be output.

        .. deprecated:: 1.3.0
           The ``on_bad_lines`` parameter should be used instead to specify behavior upon
           encountering a bad line instead.
    on_bad_lines : {'error', 'warn', 'skip'} or callable, default 'error'
        Specifies what to do upon encountering a bad line (a line with too many fields).
        Allowed values are :

            - 'error', raise an Exception when a bad line is encountered.
            - 'warn', raise a warning when a bad line is encountered and skip that line.
            - 'skip', skip bad lines without raising or warning when they are encountered.

        .. versionadded:: 1.3.0

        .. versionadded:: 1.4.0

            - callable, function with signature
              ``(bad_line: list[str]) -> list[str] | None`` that will process a single
              bad line. ``bad_line`` is a list of strings split by the ``sep``.
              If the function returns ``None``, the bad line will be ignored.
              If the function returns a new list of strings with more elements than
              expected, a ``ParserWarning`` will be emitted while dropping extra elements.
              Only supported when ``engine="python"``

    delim_whitespace : bool, default False
        Specifies whether or not whitespace (e.g. ``' '`` or ``'    '``) will be
        used as the sep. Equivalent to setting ``sep='\s+'``. If this option
        is set to True, nothing should be passed in for the ``delimiter``
        parameter.
    low_memory : bool, default True
        Internally process the file in chunks, resulting in lower memory use
        while parsing, but possibly mixed type inference.  To ensure no mixed
        types either set False, or specify the type with the `dtype` parameter.
        Note that the entire file is read into a single DataFrame regardless,
        use the `chunksize` or `iterator` parameter to return the data in chunks.
        (Only valid with C parser).
    memory_map : bool, default False
        If a filepath is provided for `filepath_or_buffer`, map the file object
        directly onto memory and access the data directly from there. Using this
        option can improve performance because there is no longer any I/O overhead.
    float_precision : str, optional
        Specifies which converter the C engine should use for floating-point

### read_csv 함수로 파일 읽기

- csv 파일을 값을 쉼표로 구분해서 처리
- 보통 엑셀 파일을 csv로 변환해서 처리한다.
- 파일을 읽으면 데이터프레임으로 변수 이름을 df로 시작해서 지정한다.

In [22]:
df = pd.read_csv(path)

In [25]:
type(df)

pandas.core.frame.DataFrame

### 데이터프레임 데이터를 앞과 뒤부분 정보확인

- head, tail 메서드로 앞과 뒤의 데이터를 확인한다

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [24]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

## 1-3 데이터프레임의 구성정보 확인하기

- 데이터의 구성정보인 모양, 칼럼, 인덱스 등을 확인한다.

### 데이터프레임의 차원을 확인

In [26]:
df.shape

(891, 12)

### 데이터프레임의 칼럼정보를 확인하기

In [27]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### 데이터프레임의 행정보 확인하기

In [28]:
df.index

RangeIndex(start=0, stop=891, step=1)

### 데이터프레임 칼럼의 데이터 타입을 확인하기

- int/float 은 정수와 실수 
- 처음 파일을 읽으면 int64/float64로 처리 => 실제 8/16/32/64 를 제공해서 타입을 바꿀 수 있다. 
- object 타입은 파이썬에서 제공하는 타입을 사용한다. (예를들면 str 인 문자열을 판다스에서는 object로 인식)

In [34]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### 데이터프레임의 기본 정보 확인하기

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# 2. 데이터프레임 세부  데이터 확인

## 2-1 하나의 칼럼을 조회하고 값을 확인

In [14]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### 하나의 칼럼을 조회하기 

- 하나의 칼럼을 문자열로 인덱스 검색하면 1차원의 시리즈 객체로 확인가능하다.

In [30]:
ser1 = df['Pclass']

In [31]:
type(ser1)

pandas.core.series.Series

### 일부 시리즈 원소만 확인하기

In [32]:
ser1.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [33]:
ser1.tail()

886    2
887    1
888    3
889    1
890    3
Name: Pclass, dtype: int64

### 시리즈 내부의 자료형 확인하기 
- 시리즈는 하나의 자료형으로만 구성한다.

In [18]:
ser1.dtype

dtype('int64')

## 2-2 시리즈 내부의 유일한 값을 확인

- unique 메서드로 몇개의 값으로 구성했는지 확인
- value_counts 메서드로 각 유일한 값의 개수를 확인

### 분류된 값의 개수

In [35]:
ser1.nunique()

3

### 분류된 실제 값 확인

In [36]:
ser1.unique()

array([3, 1, 2])

### 분류된 값의 분포를 확인

In [37]:
ser1.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

## 2-3 데이터프레임의 칼럼으로 값을 조회하기

- 데이터프레임의 특징은 칼럼별로 처리하는 기준이다.
- 그래서 대부분을 칼럼으로 검색해서 처리한다.

### 인덱스 검색 내에 칼럼이름을 리스트로 전달

- 칼럼이름으로 전달하면 칼럼 별로 조회가 된다. 
- 칼럼 단위로 조회하면 데이터프레임으로 출력한다.

In [39]:
type(df[['Pclass']])

pandas.core.frame.DataFrame

In [38]:
df[['Pclass']].head()

   Pclass
0       3
1       1
2       3
3       1
4       3

### 여러 칼럼을 조회하기

- 칼럼을 리스트에 요소로 나열해서 조회한다.

In [40]:
df[['PassengerId', 'Survived', 'Pclass', 'Name']].head()

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,"Allen, Mr. William Henry"

## 2-3 데이터프레임의 자료형으로 칼럼을 조회하기

-  select_dtypes 메서드를 사용해서 특정 자료형을 선택해서 칼럼을 조회하기
-  매개변수 include는 포함되는 자료형 exclude 매개변수는 포함하지 않는 자료형을 지정

### 칼럼명을 한글로 변환하기 

- 대부분 영문이므로 이에 해당하는 한글명을 작성한다.
- columns 속성은 동일한 사이즈의 리스트와 대체가 가능하지만 내부의 원소를 변경할 수 없다.

In [42]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [45]:
cols =['승객번호','생존여부','승객등급','이름','성별','나이','가족탑승',
      '파치', '티켓', '운임', '객실', '탑승']

In [46]:
df.columns = cols

### 숫자 자료형만 확인한다

- 특정 자료형의 칼럼을 처리 : select_dtypes 
- include는 number(int, float), object
- 또는 exclude를 지정해서 그외 자료형만 추출

In [47]:
df.select_dtypes(include="number")

     승객번호  생존여부  승객등급    나이  가족탑승  파치       운임
0       1     0     3  22.0     1   0   7.2500
1       2     1     1  38.0     1   0  71.2833
2       3     1     3  26.0     0   0   7.9250
3       4     1     1  35.0     1   0  53.1000
4       5     0     3  35.0     0   0   8.0500
..    ...   ...   ...   ...   ...  ..      ...
886   887     0     2  27.0     0   0  13.0000
887   888     1     1  19.0     0   0  30.0000
888   889     0     3   NaN     1   2  23.4500
889   890     1     1  26.0     0   0  30.0000
890   891     0     3  32.0     0   0   7.7500

[891 rows x 7 columns]

### 숫자자료형만 조회되었는지 확인한다.

In [48]:
df.select_dtypes(include="number").dtypes

승객번호      int64
생존여부      int64
승객등급      int64
나이      float64
가족탑승      int64
파치        int64
운임      float64
dtype: object

### 숫자를 제외한 칼럼만 조회하기

In [49]:
df.select_dtypes(exclude="number")

,이름,성별,티켓,객실,탑승
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

### 판다스에서 파이썬 자료형은 전부 object 타입으로 인식한다.

-  보통 이 object 자료형은 대부분 문자열로 처리된다

In [50]:
df.select_dtypes(exclude="number").dtypes

이름    object
성별    object
티켓    object
객실    object
탑승    object
dtype: object

## 2-4 데이터프레임의 칼럼을 이름으로 조회하기

- filter 메서드의 like를 사용해서 칼럼의 이름을 조회

### 특정한 문자를 지정하면 해당 칼럼을 조호한다

In [52]:
df.filter(like="승")

     승객번호  승객등급  가족탑승 탑승
0       1     3     1  S
1       2     1     1  C
2       3     3     0  S
3       4     1     1  S
4       5     3     0  S
..    ...   ...   ... ..
886   887     2     0  S
887   888     1     0  S
888   889     3     1  S
889   890     1     0  C
890   891     3     0  Q

[891 rows x 4 columns]

### 특정 단어가 들어있는 여러 칼럼을 조회하기

In [53]:
df.filter(like="이")

                                                    이름    나이
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

## 2-3. 판다스 행별 데이터 확인 

- 데이터프레임은 보통 칼럼 기준으로 검색한다.
- 데이터프레임을 행기준으로 처리하려면 loc, iloc라는 별도의 인덱서 객체를 사용해야한다.
- loc는 인덱스의 이름으로 조회한다.
- iloc는 인덱스의 값으로 조회한다.

## 2-3-1 인덱스의 이름으로 조회하기

- loc 인덱서는 행과 열의 인덱스의 이름으로 조회한다.
- 보통 인덱스는 숫자이고 칼럼은 문자이다.

## 인덱스 처리 간단한 예제 알아보기

In [8]:
df_test = pd.DataFrame([[2, 3], [5, 6], [8, 9]],
     index=['cobra', 'viper', 'sidewinder'],
     columns=['max_speed', 'shield'])
df_test

            max_speed  shield
cobra               2       3
viper               5       6
sidewinder          8       9

##  인덱스 이름으로 행에 대해서만 읽기
![](../image/loc처리2.png)

In [9]:
df_test.loc['viper']

max_speed    5
shield       6
Name: viper, dtype: int64

In [10]:
df_test.loc[['viper','sidewinder']]

            max_speed  shield
viper               5       6
sidewinder          8       9

## loc 인덱서에서 연산자  처리

![](../image/loc처리1.png)

In [13]:
df_test.loc[df_test['shield'] > 6]

            max_speed  shield
sidewinder          8       9

### 인덱스 정보에 따른 행을 조회하기

- loc 객체를 사용한다.
- 이때 인덱스 검색에 첫번째는 행의 정보, 두번째는 칼렴이름을 사용 ]

In [54]:
df.select_dtypes(include="number").columns

Index(['승객번호', '생존여부', '승객등급', '나이', '가족탑승', '파치', '운임'], dtype='object')

In [55]:
df.loc[1:100,df.select_dtypes(include="number").columns]

     승객번호  생존여부  승객등급    나이  가족탑승  파치       운임
1       2     1     1  38.0     1   0  71.2833
2       3     1     3  26.0     0   0   7.9250
3       4     1     1  35.0     1   0  53.1000
4       5     0     3  35.0     0   0   8.0500
5       6     0     3   NaN     0   0   8.4583
..    ...   ...   ...   ...   ...  ..      ...
96     97     0     1  71.0     0   0  34.6542
97     98     1     1  23.0     0   1  63.3583
98     99     1     2  34.0     0   1  23.0000
99    100     0     2  34.0     1   0  26.0000
100   101     0     3  28.0     0   0   7.8958

[100 rows x 7 columns]

## 2-3-2 인덱스의 숫자 정보로 처리하기

- 데이터프레임은 내부적으로는 행과 열의 인덱스가 숫자로 지정되어있다.
- 보통 데이터프레임의 행의 인덱스는 숫자이지면 내부적으로는 별도의 기본 인덱스가 지정되어 있다.

### 행과 열의 인덱스로 지정해서 읽기
- 칼럼은 2번째 3번째 4번째 칼럼을 지정해서 읽는다

In [56]:
df.iloc[:100,[1,2,3]]

    생존여부  승객등급                                                 이름
0      0     3                            Braund, Mr. Owen Harris
1      1     1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2      1     3                             Heikkinen, Miss. Laina
3      1     1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4      0     3                           Allen, Mr. William Henry
..   ...   ...                                                ...
95     0     3                        Shorney, Mr. Charles Joseph
96     0     1                          Goldschmidt, Mr. George B
97     1     1                    Greenfield, Mr. William Bertram
98     1     2               Doling, Mrs. John T (Ada Julia Bone)
99     0     2                                  Kantor, Mr. Sinai

[100 rows x 3 columns]

### 특정 칼럼을 읽기위해 컴프리헨션을 사용

- 칼럼의 인덱스가 짝수인 경우만 조회

In [57]:
ss = [i for i,_ in enumerate(df.columns) if i %2 ==0]

In [58]:
df.iloc[:100,ss]

    승객번호  승객등급      성별  가족탑승                티켓       객실
0      1     3    male     1         A/5 21171      NaN
1      2     1  female     1          PC 17599      C85
2      3     3  female     0  STON/O2. 3101282      NaN
3      4     1  female     1            113803     C123
4      5     3    male     0            373450      NaN
..   ...   ...     ...   ...               ...      ...
95    96     3    male     0            374910      NaN
96    97     1    male     0          PC 17754       A5
97    98     1    male     0          PC 17759  D10 D12
98    99     2  female     0            231919      NaN
99   100     2    male     1            244367      NaN

[100 rows x 6 columns]

# 3.   판다스 전체 데이터 확인 : 통계 

- 데이터의 기술통계 값을 확인할 수 있는 메소드들을 확인한다.

## 3-1 숫자값에 대한 통계 정보 확인

### 숫자 칼럼 가져오기

In [59]:
df_num = df.select_dtypes(include="number")

### 최대값과 최소값 확인하기

In [60]:
df_num.max()

승객번호    891.0000
생존여부      1.0000
승객등급      3.0000
나이       80.0000
가족탑승      8.0000
파치        6.0000
운임      512.3292
dtype: float64

In [61]:
df_num.min()

승객번호    1.00
생존여부    0.00
승객등급    1.00
나이      0.42
가족탑승    0.00
파치      0.00
운임      0.00
dtype: float64

### 평균값과 중앙값 가져오기

In [62]:
df_num.mean()

승객번호    446.000000
생존여부      0.383838
승객등급      2.308642
나이       29.699118
가족탑승      0.523008
파치        0.381594
운임       32.204208
dtype: float64

In [63]:
df_num.median()

승객번호    446.0000
생존여부      0.0000
승객등급      3.0000
나이       28.0000
가족탑승      0.0000
파치        0.0000
운임       14.4542
dtype: float64

### 분포에 대한 데이터 가져오기

In [64]:
df_num.quantile([0.25,0.5,0.75])

       승객번호  생존여부  승객등급      나이  가족탑승   파치       운임
0.25  223.5   0.0   2.0  20.125   0.0  0.0   7.9104
0.50  446.0   0.0   3.0  28.000   0.0  0.0  14.4542
0.75  668.5   1.0   3.0  38.000   1.0  0.0  31.0000

### 분산 및 표준편차 처리하기

In [65]:
df_num.var()

승객번호    66231.000000
생존여부        0.236772
승객등급        0.699015
나이        211.019125
가족탑승        1.216043
파치          0.649728
운임       2469.436846
dtype: float64

In [66]:
df_num.std()

승객번호    257.353842
생존여부      0.486592
승객등급      0.836071
나이       14.526497
가족탑승      1.102743
파치        0.806057
운임       49.693429
dtype: float64

### 전체 요약통계 처리하기

In [67]:
df_num.describe()

,승객번호,생존여부,승객등급,나이,가족탑승,파치,운임
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 칼럼이 많은 경우는 전치해서 요약통계 확인하기

In [68]:
df_num.describe().T

      count        mean         std   min       25%       50%    75%       max
승객번호  891.0  446.000000  257.353842  1.00  223.5000  446.0000  668.5  891.0000
생존여부  891.0    0.383838    0.486592  0.00    0.0000    0.0000    1.0    1.0000
승객등급  891.0    2.308642    0.836071  1.00    2.0000    3.0000    3.0    3.0000
나이    714.0   29.699118   14.526497  0.42   20.1250   28.0000   38.0   80.0000
가족탑승  891.0    0.523008    1.102743  0.00    0.0000    0.0000    1.0    8.0000
파치    891.0    0.381594    0.806057  0.00    0.0000    0.0000    0.0    6.0000
운임    891.0   32.204208   49.693429  0.00    7.9104   14.4542   31.0  512.3292

## 3-2 범주값에 대한 통계 확인

### 문자열 칼럼값만 가져오기

In [69]:
df_obj = df.select_dtypes(exclude="number")

### 데이터 확인하기

In [70]:
df_obj.head()

,이름,성별,티켓,객실,탑승
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

### 개수 확인하기

In [71]:
df_obj.count()

이름    891
성별    891
티켓    891
객실    204
탑승    889
dtype: int64

### 각 칼럼의 유니크 값 확인하기

In [72]:
df_obj.nunique()

이름    891
성별      2
티켓    681
객실    147
탑승      3
dtype: int64

### 요약통계 확인하기

In [73]:
df_obj.describe()

                             이름    성별      티켓       객실   탑승
count                       891   891     891      204  889
unique                      891     2     681      147    3
top     Braund, Mr. Owen Harris  male  347082  B96 B98    S
freq                          1   577       7        4  644